import { Product } from './lib/models/product.interface'

const productsData: Product[] = [
	{
		id: 1,
		name: 'Дима',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Собой социально-экономическое направлений степени системы обучения важные всего участия массового. Повседневная разработке широким широким сложившаяся намеченных новых подготовке организации. Современного выбранный что другой же однако.\nЗначимость профессионального подготовке показывает принципов повышение выбранный влечёт поставленных. Принципов задания вызывает процесс значительной курс. Идейные уровня важные богатый кадров а.\nРазнообразный ресурсосберегающих напрямую постоянное существующий деятельности модели нами другой качества. Форм процесс представляет значительной. Разработке участниками в.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '2',
		name: 'Саша',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Проверки идейные таким целесообразности порядка разработке шагов.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '3',
		name: 'Влад',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Сущности внедрения повседневная постоянное систему последовательного формированию позиции. Демократической этих формировании формирования опыт. Модели деятельности прежде задача национальный значение.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '4',
		name: 'Максим',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Прежде сомнений задания важные образом курс предложений постоянный.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '5',
		name: 'Саша Галкин',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Правительством а способствует поставленных рост представляет условий социально-экономическое обществом плановых. Способствует повышению следует показывает задач сфера. Дальнейших задания эксперимент позиции.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '6',
		name: 'Эмиркаа',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Кадровой по идейные направлений формировании значимость.\nСуществующий модель намеченных не показывает организационной процесс высшего начало.\nВажную интересный однако.\nФорм прежде соответствующих сознания выбранный финансовых создаёт.\nАктивом системы организации социально-ориентированный активизации широким.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '7',
		name: 'Рома',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Нами формированию кругу сложившаяся формированию богатый концепция участниками.\nПринципов место потребностям собой сомнений формировании.\nФинансовых важные дальнейших создаёт представляет активности специалистов.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '8',
		name: 'Матвей',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Профессионального прогресса повседневная структура целесообразности всего выбранный количественный прежде развития.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '9',
		name: 'Егор',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '10',
		name: 'Вася',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '11',
		name: 'Игорь',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '12',
		name: 'Маленький Меховой Куртка',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '13',
		name: 'Маленький Меховой Куртка',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '14',
		name: 'Маленький Меховой Куртка',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '15',
		name: 'Маленький Меховой Куртка',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '16',
		name: 'Маленький Меховой Куртка',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '17',
		name: 'Маленький Меховой Куртка',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '18',
		name: 'Маленький Меховой Куртка',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '19',
		name: 'Маленький Меховой Куртка',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '20',
		name: 'Маленький Меховой Куртка',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '21',
		name: 'Бэм',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '22',
		name: 'Бум',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '23',
		name: 'Бам',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
	{
		id: '24',
		name: 'ЛОл',
		image: 'https://loremflickr.com/640/480/cats',
		description:
			'Таким важные условий воздействия соответствующей изменений очевидна проект. Требует обществом широким сознания другой. Понимание прогресса стороны.\nВажную всего новая следует реализация повседневная модель ресурсосберегающих занимаемых. Участниками другой уточнения постоянное следует практика. Анализа другой степени.\nА выбранный сложившаяся гражданского идейные массового участия вызывает выбранный не. Материально-технической укрепления однако ресурсосберегающих равным играет общественной соответствующей образом следует. Показывает подготовке проверки оценить участниками требует стороны и различных.',
		price: '150.99',
		isInCart: false,
	},
]

export const getAllProducts = (): Promise<Product[]> => {
	return new Promise(resolve => {
		setTimeout(() => resolve(productsData), Math.random() * 1000)
	})
}

export const getProductById = (id: string) => {
	const product = productsData.find(product => product.id === id)

	return new Promise(resolve => {
		setTimeout(() => resolve(product), Math.random() * 1000)
	})
}
